addons/hs_video/core/modules/api/models/VideoForm.php

    public function search()
    {
        if (!$this->validate())
            return $this->getModelError();

        $old_video = Video::findOne([
            'store_id' => $this->store_id,
            'is_delete' => 0,
            'id' => $this->video_id,
        ]);
        $old_video->page_view += 1;
        $old_video->save();
        $video = Video::find()->alias('v')->where([
            'v.store_id' => $this->store_id,
            'v.is_delete' => 0,
            'v.id' => $this->video_id,
        ])->select([
            'v.*'
        ])->asArray()->one();
        $video['video_time'] = TimeToDay::time($video['video_time']);
        $video['page_view'] = TimeToDay::getPageView($video['page_view']);
        if($video['type'] == 1){//腾讯视频解析
            $res = getInfo::getVideoInfo($video['video_url']);
            $video['video_url'] = $res['url'];
        }
        $video['collect_count'] = Collect::find()->where(['store_id' => $this->store_id, 'video_id' => $this->video_id, 'is_delete' => 0])->count();

        $form_list = Form::find()->select([
            'name', 'type', 'required', 'default', 'tip'
        ])->where(['store_id' => $this->store_id, 'video_id' => $video['id'], 'is_delete' => 0])->orderBy(['sort' => SORT_ASC])->asArray()->all();
---
UPDATE `zjhj_video_video` SET `page_view`=105 WHERE `id`=1
SELECT `name`, `type`, `required`, `default`, `tip` FROM `zjhj_video_form` WHERE (`store_id`=1) AND (`video_id`='1') AND (`is_delete`=0) ORDER BY `sort`

            $video['collect'] = 1;
        }

        $video_coupon= VideoCoupon::find()->where(['video_id'=>$this->video_id,'store_id'=>$this->store_id,'is_delete'=>0])->asArray()->all();
---
SELECT * FROM `zjhj_video_coupon` WHERE (`video_id`='1') AND (`store_id`=1) AND (`is_delete`=0)